Refacor Utilities and file name read me
